
# sales

In [3]:
import pandas as pd

In [4]:
vendite = pd.read_csv("Supermarket Sales 2.csv")
vendite

,Date,Branch,Customer type,Gender,Product line,Unit price,Quantity,Payment,Rating
0,1/1/2024,Brooklyn,Member,Female,Food & Beverages,84.63,10,Credit card,9.0
1,1/1/2024,Queens,Normal,Female,Electronics,63.22,2,Cash,8.5
2,1/1/2024,Brooklyn,Normal,Female,Electronics,74.71,6,Cash,6.7
3,1/1/2024,Queens,Member,Female,Sports & Travel,36.98,10,Credit card,7.0
4,1/1/2024,Manhattan,Member,Female,Sports & Travel,27.04,4,Ewallet,6.9
...,...,...,...,...,...,...,...,...,...
5048,12/31/2024,Manhattan,Normal,Female,Food & Beverages,6.71,10,Cash,5.9
5049,12/31/2024,Brooklyn,Normal,Male,Food & Beverages,6.79,9,Credit card,4.8
5050,12/31/2024,Queens,Member,Male,Electronics,85.05,7,Ewallet,4.4
5051,12/31/2024,Manhattan,Member,Female,Sports & Travel,54.64,10,Credit card,4.8
5052,12/31/2024,Queens,Normal,Female,Health & Beauty,49.75,7,Cash,5.8

In [5]:
print(vendite.info())

<class 'pandas.DataFrame'>
RangeIndex: 5053 entries, 0 to 5052
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Date           5053 non-null   str
 1   Branch         5053 non-null   str
 2   Customer type  5053 non-null   str
 3   Gender         5053 non-null   str
 4   Product line   5053 non-null   str
 5   Unit price     5053 non-null   float64
 6   Quantity       5053 non-null   int64
 7   Payment        5053 non-null   str
 8   Rating         5053 non-null   float64
dtypes: float64(2), int64(1), str(6)
memory usage: 355.4 KB
None

In [6]:
print(vendite.describe())

        Unit price     Quantity       Rating
count  5053.000000  5053.000000  5053.000000
mean     39.692988     4.593509     6.884029
std      29.557474     2.787934     1.710245
min       2.010000     1.000000     3.000000
25%      11.630000     2.000000     5.600000
50%      33.900000     4.000000     7.100000
75%      64.940000     7.000000     8.200000
max      99.960000    10.000000    10.000000

In [9]:
quantita = vendite["Quantity"]
quantita.head(10)

0    10
1     2
2     6
3    10
4     4
5     9
6     8
7     6
8     2
9     8
Name: Quantity, dtype: int64

In [10]:
print(quantita.mean())
print(quantita.mode())
print(quantita.median())
print(quantita.std())

4.593508806649515
0    2
Name: Quantity, dtype: int64
4.0
2.787934468442221

In [11]:
print(vendite["Unit price"].mean())
print(vendite["Branch"].value_counts())

39.692988323768056
Branch
Brooklyn     1793
Manhattan    1705
Queens       1555
Name: count, dtype: int64